In [2]:
import os
os.getcwd()

'C:\\Users\\HP'

In [3]:
os.chdir("C:/Users/HP/Desktop/Datasets")

In [4]:
os.getcwd()

'C:\\Users\\HP\\Desktop\\Datasets'

In [6]:
import numpy as np
import pandas as pd
df = pd.read_csv('sales.csv')
print(df.head())

   Sales Executive      Name Gender  Age   Location  Sales in Rs
0                1    Mahesh   Male   25  Hyderabad           50
1                2    Suresh   Male   22  Hyderabad           75
2                3     Vijay   Male   20  Bangalore           11
3                4    Ramesh   Male   27  Bangalore           77
4                5  Jagadish   Male   28     Mumbai           45

In [7]:
df.describe()

       Sales Executive        Age  Sales in Rs
count         20.00000  20.000000    20.000000
mean          10.50000  24.600000    43.550000
std            5.91608   2.835861    19.974918
min            1.00000  19.000000    11.000000
25%            5.75000  23.750000    28.750000
50%           10.50000  24.000000    38.000000
75%           15.25000  26.250000    56.000000
max           20.00000  30.000000    77.000000

In [9]:
df.cov()

                 Sales Executive       Age  Sales in Rs
Sales Executive        35.000000  2.947368   -13.868421
Age                     2.947368  8.042105     6.705263
Sales in Rs           -13.868421  6.705263   398.997368

In [10]:
df.corr()

                 Sales Executive       Age  Sales in Rs
Sales Executive         1.000000  0.175677    -0.117357
Age                     0.175677  1.000000     0.118371
Sales in Rs            -0.117357  0.118371     1.000000